sdaiValidateAggrSizes(Sdai_instS*,Sdai_Id_aggr*)
\details
Validates whether the aggregate size constraints defined in the data dictionary for the specified application instance are satisfied.
Retrieves the non-persistent list of attributes with unsatisfied size constraints, if found.
\param instance [in]  Identifier of the application instance to be validated.
\param list     [out] The identifier of a pre-existing NPL to which the SdaiAttr identifiers of
those attributes are appended that do not conform to the validation.
\returns
* sdaiTRUE if attributes with unsatisfied size constraints are not found.
* sdaiFALSE if such attributes are found.
* sdaiUNKNOWN if an error is encountered.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiMX_NDEF - SDAI-model access not defined.
* sdaiEI_NEXS - Instance does not exist.
* sdaiAI_NEXS - Aggregate instance does not exist.
* sdaiEX_NSUP - Expression evaluation not supported.
* sdaiVA_NSET - Value not set.
* sdaiFN_NAVL - Function not available.
* sdaiSY_ERR - Underlying system error.
\code
SdaiAppInstance cp1 = sdaiCreateInstanceBN(model, "ifccartesianpoint");
SdaiAggr coordinates = sdaiCreateAggrBN(cp1, "coordinates");
SdaiNPL npl = sdaiCreateNPL();
SdaiLogical check1 = sdaiValidateAggrSizes(cp1, npl); // sdaiUNKNOWN, npl contains "coordinates" attribute definition
sdaiDeleteNPL(npl);
// Now fill 3 coordinates
npl = sdaiCreateNPL();
sdaiPutAggrByIndex(coordinates, 0, sdaiREAL, 1.);
sdaiPutAggrByIndex(coordinates, 1, sdaiREAL, 2.);
sdaiPutAggrByIndex(coordinates, 2, sdaiREAL, 3.);
SdaiLogical check2 = sdaiValidateAggrSizes(ifcApprovalRelationshipInstance, npl); // sdaiTRUE, npl is empty
// Now add one extra coordinate, so the validation fails
sdaiPutAggrByIndex(coordinates, 3, sdaiREAL, 4.);
SdaiLogical check3 = sdaiValidateAggrSizes(ifcApprovalRelationshipInstance, npl); // sdaiFALSE, npl contains "coordinates" attribute definition
sdaiDeleteNPL(npl);